tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/moderatelyDense/CFD/0/vSmoothField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vSmoothField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletGas
    {
        type            zeroGradient;
    }

    InletSolidLeft
    {
        type            zeroGradient;
    }

    InletSolidRight
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBackPlanes    
    {
        type            empty;
    }
}


// ************************************************************************* //
