tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/moderatelyDense/CFD/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// sub-models & settings

syncMode false;

modelType "A";

couplingInterval 50;

voidFractionModel centre;

locateModel engine;

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel off;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dense;

clockModel off;

smoothingModel constDiffSmoothing;

forceModels
(
    BeetstraDrag
    gradPForce
    viscForce
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "turbulenceProperties";


// sub-model properties

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}


gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
    treatForceExplicit;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
    treatForceExplicit;
}

BeetstraDragProps
{
    velFieldName "U";
    granVelFieldName "Us";
    rhoParticle 1000.;
    voidfractionFieldName "voidfraction";
    interpolation true;
    implForceDEM;
}

engineProps
{
    treeSearch true;
}

constDiffSmoothingProps
{
    lowerLimit 0.01;
    upperLimit 1.0;
    smoothingLength 0.0015;
}

centreProps
{
    alphaMin 0.01;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

// ************************************************************************* //
